# LeetCode SQL Solutions

## Table of Contents
1. Problem 1: [196. Delete duplication Email](https://leetcode.com/problems/delete-duplicate-emails/?envType=study-plan-v2&envId=top-sql-50)

# 196. Delete duplication Email

Table: Person

| Column Name | Type    |
|-------------|---------|
| id          | int     |
| email       | varchar |

- `id` is the primary key (column with unique values) for this table.
- Each row of this table contains an email. The emails will not contain uppercase letters.

## Problem Statement

Write a solution to delete all duplicate emails, keeping only one unique email with the smallest id.

> **Note for SQL users**: You are supposed to write a `DELETE` statement and not a `SELECT` one.

> **Note for Pandas users**: You are supposed to modify `Person` in place.

After running your script, the answer shown is the `Person` table. The driver will first compile and run your piece of code and then show the `Person` table. The final order of the `Person` table does not matter.

## Example

### Input: 
`Person` table:

| id | email            |
|----|------------------|
| 1  | john@example.com |
| 2  | bob@example.com  |
| 3  | john@example.com |

### Output: 
| id | email            |
|----|------------------|
| 1  | john@example.com |
| 2  | bob@example.com  |

**Explanation**: `john@example.com` is repeated two times. We keep the row with the smallest id = 1.

First I tried this solution:

### SQL Solution

```sql
SELECT a.name, b.salary
FROM Employee a
LEFT JOIN Salary b ON a.id = b.emp_id;

This SQL query result in an error due to the use of the SELECT subquery within a DELETE statement, as many database systems do not allow modifying a table (DELETE in this case) while also selecting from the same table in a subquery (due to issues like possible data modification conflicts).

Here are two common issues:

- Subquery modification restriction: Some SQL engines (e.g., MySQL) do not allow selecting from the same table that yo are trying to modify in the DELETE query.

- Efficient deletion: Even if the query works in some databases, it is not necessarily optimized for performance, especially if you have a large dataset.

This can be resolved as follows:

```sql
with helper as
(select min(id) as min_id from Person group by email)
delete from Person
where id not in (select min_id from helper)

# 1484. Group Sold Products By The Date


Table: Activities

| Column Name | Type    |
|-------------|---------|
| sell_date   | date    |
| product     | varchar |

- There is no primary key (column with unique values) for this table. It may contain duplicates.
- Each row of this table contains the product name and the date it was sold in a market.

### Problem Statement

Write a solution to find for each date the number of different products sold and their names.

The sold products names for each date should be sorted lexicographically.

Return the result table ordered by `sell_date`.

### Example

### Input: 
`Activities` table:

| sell_date  | product     |
|------------|-------------|
| 2020-05-30 | Headphone   |
| 2020-06-01 | Pencil      |
| 2020-06-02 | Mask        |
| 2020-05-30 | Basketball  |
| 2020-06-01 | Bible       |
| 2020-06-02 | Mask        |
| 2020-05-30 | T-Shirt     |

### Output: 
| sell_date  | num_sold | products                     |
|------------|----------|------------------------------|
| 2020-05-30 | 3        | Basketball,Headphone,T-Shirt |
| 2020-06-01 | 2        | Bible,Pencil                 |
| 2020-06-02 | 1        | Mask                         |

**Explanation**: 
- For 2020-05-30, sold items were (Headphone, Basketball, T-Shirt); they are sorted lexicographically and separated by a comma.
- For 2020-06-01, sold items were (Pencil, Bible); they are sorted lexicographically and separated by a comma.
- For 2020-06-02, the sold item is (Mask); it is returned as is.

Trick:

Utilized the `GROUP_CONCAT` function in MySQL to return row values in a comma-separated format, allowing for efficient aggregation of product names sold on specific dates.

### SQL solution

```sql
select sell_date, count(distinct product) as num_sold , GROUP_CONCAT(distinct product order by product) as products
from Activities
group by sell_date
order by sell_date, num_sold

## 1327. List the Products Ordered in a Period

Table: Products

| Column Name      | Type    |
|------------------|---------|
| product_id       | int     |
| product_name     | varchar |
| product_category | varchar |

- `product_id` is the primary key (column with unique values) for this table.
- This table contains data about the company's products.

## Table: Orders

| Column Name   | Type    |
|---------------|---------|
| product_id    | int     |
| order_date    | date    |
| unit          | int     |

- This table may have duplicate rows.
- `product_id` is a foreign key (reference column) to the Products table.
- `unit` is the number of products ordered on `order_date`.

### Problem Statement

Write a solution to get the names of products that have at least 100 units ordered in February 2020 and their amount.

Return the result table in any order.

### Example

**Input:**

Products table:

| product_id  | product_name          | product_category |
|-------------|-----------------------|------------------|
| 1           | Leetcode Solutions    | Book             |
| 2           | Jewels of Stringology | Book             |
| 3           | HP                    | Laptop           |
| 4           | Lenovo                | Laptop           |
| 5           | Leetcode Kit          | T-shirt          |

Orders table:

| product_id   | order_date   | unit     |
|--------------|--------------|----------|
| 1            | 2020-02-05   | 60       |
| 1            | 2020-02-10   | 70       |
| 2            | 2020-01-18   | 30       |
| 2            | 2020-02-11   | 80       |
| 3            | 2020-02-17   | 2        |
| 3            | 2020-02-24   | 3        |
| 4            | 2020-03-01   | 20       |
| 4            | 2020-03-04   | 30       |
| 4            | 2020-03-04   | 60       |
| 5            | 2020-02-25   | 50       |
| 5            | 2020-02-27   | 50       |
| 5            | 2020-03-01   | 50       |

**Output:**

| product_name       | unit    |
|--------------------|---------|
| Leetcode Solutions | 130     |
| Leetcode Kit       | 100     |

### Explanation

- Products with `product_id` = 1 were ordered in February for a total of (60 + 70) = 130 units.
- Products with `product_id` = 2 were ordered in February for a total of 80 units.
- Products with `product_id` = 3 were ordered in February for a total of (2 + 3) = 5 units.
- Products with `product_id` = 4 were not ordered in February 2020.
- Products with `product_id` = 5 were ordered in February for a total of (50 + 50) = 100 units.

# Trick:

`DATE_FORMAT` is a function in SQL (commonly used in MySQL) that allows you to format date values based on a specified format string. It is useful for presenting date values in different formats like YYYY-MM-DD, MM/DD/YYYY, or extracting parts of a date like the month or year.

Syntax
```sql
DATE_FORMAT(date, format)
```

- date: The date value you want to format.
- format: The string that defines the output format.
- Common Format Specifiers
- %Y: Four-digit year (e.g., 2023)
- %m: Two-digit month (e.g., 09 for September)
- %d: Two-digit day of the month (e.g., 27)
- %H: Two-digit hour (24-hour format)
- %i: Two-digit minute
- %s: Two-digit second

### SQL solution

```sql
select min(p.product_name) as product_name ,sum(o.unit) as unit
from Orders o
join Products p
on o.product_id = p.product_id
and year(o.order_date)=2020  and month(o.order_date)=2   # date_forma(o.order_date, '%Y-%m')='2020-02'
group by o.product_id
having sum(o.unit)>=100